# docs(contributors): 开发者寄语 #0

### UNIkeEN · 项目负责人、全栈开发

从确定立项到第一个公开测试版发布，SJMCL 的开发历程跨越了我大四的一整个学年。八个月的时光里，我和小伙伴们摸索着~~文档还不完全~~的技术框架、奇迹般地没有咕咕，感谢开发组同学们的努力与陪伴。

* 在这里，我们学习了新的开发技能，在激烈的讨论中摸索用户设计与软件工程的最佳实践；以项目为载体，新同学也能在指导下快速提升开发技能
* 我们结交了志同道合的朋友，樱花季的辰山植物园里我们高谈阔论、欢声笑语
* 我们还深化了校际合作，在过去现在与未来和来自 MUA 的友校共同迭代推进

未来，期待启动器可以为社员和广大 MC 玩家提供优质的使用体验。更多的特性和**神奇妙妙小功能**敬请期待！

---

### Reqwey · 全栈开发

> 以项目为载体，新同学也能在指导下快速提升开发技能

作为大一新生，偶然的机会被 UNIkeEN 邀入启动器开发群后，立刻被其精美的界面所迷倒（虽然当时几乎处于纯静态）。几乎没有 Rust 开发经验的我，在 w1049 与 ToolmanP 等大神的教诲下逐步成长，依次参与了账户管理、游戏资源获取、下载器逻辑，与实例、加载器、整合包的安装等的前后端开发工作，一跃成为**项目第二大贡献者**。

多少个日夜充斥着我为 bug 折磨的苦恼与豁然开朗的喜悦，在同伴们一道呵护中与 SJMCL 一起成长，到如今它终于问世，这也许就是**热爱的力量**。

---

### Sunday · 全栈开发

参与到SJMCL的开发是一件幸运的事情！整个开发过程与其说是干活，不如说更像是冒险，或是一种任务驱动式的、快速见效的学习：每一次新功能添加都是对一个全新领域的探索，每一次重构和bug修复都是对代码优雅、规范的强调

作为一个开发者，它可以说是我花心思最多的项目之一；作为社团的一员，我也很期待大家能在使用SJMCL时感觉到它的**优雅、独特和对友商的遥遥领先**（

---

### Toolmanp · 后端开发

只是做了一点微小的工作

---

### UNIkeEN · 项目负责人、全栈开发

> 只是做了一点微小的工作

Rust 大神不要谦虚喵

---


### HsxMark · 前端开发

大家好，我是**SUESMC社团社长**HsxMark，很荣幸能够作为前端开发者参与到SJMCL的开发中。

非常感谢UNIkeEN和其他小伙伴们引领我进入这段旅程，没有他们的帮助我将继续徘徊在原地。尽管我的贡献微不足道，但是这次旅程却让我学到了很多知识，认识了很多朋友，迈出了我的第一步。最后，祝SJMC越办越好，再创新高！

---

### baiyuan · 前端开发

作为社团的一份子，我们带着对方块世界的热爱与校园里的探索精神，打磨出了sjmcl启动器。

我们想做的不只是一个启动工具——更是想把交大人的严谨与我们对MC的热忱拧成一股绳，让每一次点击启动，都成为奔赴方块冒险的顺畅起点。

感谢每一份期待，也期待你和sjmcl一起，在像素世界里碰撞出更多可能。

---

### w1049 · 后端开发

Minecraft 是 MC 🤔，鸣潮也算 MC 🤔🤔，MobiCom 好像也是一种 MC 🤔🤔🤔，不管了，MC——启动！

---

### pangbo · CI/CD

> MC——启动！

启动器一定要能启动

---

### UNIkeEN · 项目负责人、全栈开发

✍️✍️✍️✍️✍️✍️

---

### Teruteru · 测试开发

SJMCL 是一次积极拥抱新技术的尝试，我们选用下一代桌面应用开发框架 Tauri，这既是对团队开发和协作能力的考验，也是跳出舒适区、突破自我的契机。

我们的最终目的是**尽最大可能提升产品的用户体验**。

---

### neuteria · 视觉设计

> 尽最大可能提升产品的用户体验

做图标时调配色调了好久，感觉成品不错但实际使用才发现整体偏白）
总之希望大家能喜欢~

---

### Xun_Ying · 后端开发

为什么加入启动器: 不道啊，只知道和ynk吃着火锅聊着天，突然就建了这个群，突然就决定要写

---

### Liulian · 法语本地化

> 突然就建了这个群，突然就决定要写

Bonjour？Bon不jour了

---

### modist · 后端开发

默认好评～
